{
  "transcript": "Drew: \"Hey, I just I'm from Denver Colorado. What? Part of the world are you and Wilbert from so? \"\n\nSaswat: \"Well actually all three of us grew up in Mumbai. India. Sure. Right. But Robin and I are moving. We're all based in the u.s. now and I'm actually in Dallas right now and I'm moving to San Francisco in in about two weeks.\"\n\nDrew: \"I was born and raised in San Francisco, man. You're going to have a nice night out of the country. Yeah. Arkansas is a very, very beautiful state. Not talk, not talked about very much. \"\n\nWilbert: \"It is it is.\"\n\nDrew: \"All right. So do you see? You guys know that's that's why and Wilbur Wright. I talk a lot. So I know we have 30 minutes. If you guys need to go over 30 minutes, I got time for you. No problem. And if I talk too much, just tell me. Stop awesome. What would you really do? \"\n\nSaswat: \"Well, it really appreciate you being candid with us there. Oh yeah, um yes, it would love to understand first a little bit about your background. Can you tell us more about your living situation and you have any dependents?\"\n\nDrew: \"Yeah. You know I'm married. Let's see. Married have two kids 8 years old girl. Five-year-old boy. Oh boy, you're at that age and then yeah, we own our house. Now we just recently paid off the mortgage in full no more. Yeah, a big congratulations. Yeah. Yeah, yeah. So I had an inheritance lately. So we took all that money and paid off the mortgage. Yeah. So we own our single family home. Here in the Denver area, we have quite a few assets. I'm at the stage now. I think my wife and I were going to go see a financial planner pretty soon here because we're, you know, we're doing retirement, don't want to make any mistakes, you know, you know, we want to make sure that we retire, you know, we can live. Okay. Now I have to worry about bills and inch health insurance and blah, so, you know, so We're at the point now, where probably have to see a financial planner, but your identity. \"\n\nSaswat: \"You don't have a financial planner yet\"\n\nDrew: \"Not yet\"\n\nSaswat: \"But have you at any point in the past?\"\n\nDrew: \"No, no, okay, no, \"\n\nSaswat: \"got it, I'm sorry. You said you said because what was your reason for not having a financial planner yet? \"\n\nDrew: \"You know I we thought we could learn it on our own. But it's just not working when we don't have enough expertise in this area to do this correctly, you know, and I'm if we're both 53, my wife and I have so we need to get for our kids to, but we need to get this, right? So we're going to, we're going to turn to The Experts financial planner to help us out. \"\n\nSaswat: \"Awesome and Logistics. Got it. Got it. And when it comes to retirement, I guess, when are you looking to retire? And how do you feel about retirement?\"\n\nDrew: \"Well how I feel about retirements is, there's two things, one excitement, right? You hat, but at the same time, I'm scared because I want to make sure that everything we've got. We'll take care of us. You know, I've seen my in-laws, they struggle because with their retirement, and the way it in the economy is so there's fear, there's fear, there's excitement and fear, and what was the other question, I'm sorry.\"\n\nSaswat: \"Yeah. So when you're looking to retire, what's your own? What's\"\n\nDrew: \"Yeah. It's a good question because I work. I work from home for a for a company, but think about starting my own business. So I think, I think that's going to be up to me. But late 60s, early, 60s, you know, if our health is okay, my wife, she wants to retire soon, so she can be home all the time with the kids too. So you know I'm going to say that. The 60s.\"\n\nSaswat: \"Got it. Got it. And Let's go into your retirement savings and and, and sort of your assets generally. So you mentioned, you've got a home that you've paid off. What's the what's the value of the home today? \"\n\nDrew: \"Yeah, wrote some stuff down for you. Somebody sent me a little it's all. \"\n\nSaswat: \"Yes, yes. Yeah, yeah. So let's start with the first couple questions. What is your income? And your household income\"\n\nDrew: \"After taxes, for me? It's 95k.\"\n\nSaswat: \"Got it after taxes, how much would it be before taxes?\"\n\nDrew: \"Say 115\"\n\nSaswat: \"Oh 115, Got it\"\n\nDrew: \"My wife, she's a nurse. So I think between the both of us we make about after taxes about 155. Okay?\"\n\nSaswat: \"What about your liability? So credit card, balances any other kinds of loans or anything like that. \"\n\nDrew: \"You know. That's a good thing that we're very blessed that so that's why we we've taken care of all our debts, except for my student loan. But no more credit card, balances 0, mortgage, Zero. You know. So we pay property taxes and insurance and stuff like that bills, but no student loan is about five grand. I got left, but I'm probably just going to pay that off about five grand, five thousand for my student loan. So liability is very small, we're very blessed.\"\n\nSaswat: \"Yeah, got it. Yep. And you mentioned you mentioned in the, in the survey screener questions that you pay off above the minimum of your credit card balances. But not the full. Does that mean that you? Yeah. Well I guess. Yeah. What is that what does that amount to? \"\n\nDrew: \"Yeah well we always thought that paying the minimum was kind of like throwing money away, you know? And so We decide if we can afford it and then I had an inheritance recently. If we can afford it might as well pay above so we can get that debt down sooner because we, huh, nobody likes to be in debt, right? So yeah, so we always paid above the minimum to try to get that balance down, got it. \"\n\nSaswat: \"And do you have any credit card debt now?\"\n\nDrew: \"know as of today, sir cya last week we paid it all off. \"\n\nSaswat: \"Only interesting, interesting and let's see. A two weeks ago. What would it look like?\"\n\nDrew: \"Oh man, it was like, man. That's what happens when you have a family and kids I was about Seventeen altogether. 17K.\"\n\nSaswat: \"yeah before the inheritance, what did that balance Look like on a monthly basis? Was it going up? Was it going down? \"\n\nDrew: \"Yeah it was going down. Yeah I think maybe earlier in the year because we had some health issues with our way. With our son stuff medical, you know, Insurance United States is health insurance and so we had a balance at one point this year of about 35 K in credit cards.\"\n\nSaswat: \"got it, got it. \"\n\nDrew: \"So it started going down, it got to 17 and we just paid it off recently.\"\n\nSaswat: \"Got it. Got it from The Inheritance that you mentioned. You receive recently. Got it, can you tell me more about no other loans, right? If paid off your mortgage, nothing else there. \"\n\nDrew: \"Yeah. No, other laws. Except for my student loan\"\n\nSaswat: \"Got it. So 5 k on the student loan\"\n\nDrew: \"Yep that's it\"\n\nSaswat: \"Can you tell me more about the asset side about any? Ira's that you have, as well as your current 401K balance. \"\n\nDrew: \"Yeah, you know, that's, that's interesting with the whole area. My wife has a naira. I have a 401k, So, and I've had the role that over from a previous job but roughly, I would say because this, I've been doing this for a long time. 53. Right? About 112. I'd say 112,000 in my 41 k.\"\n\nSaswat: \"Got it and how much would be in your wife's 401k? \"\n\nDrew: \"I put 7 percent in and my employer matches\"\n\nSaswat: \"Okay, so you put in seven percent 7 percent, got it. And what's the max? So what is your employer's 401K policy in terms of how much do they match up to what amount\"\n\nDrew: \"Oh yeah, Dave match they match. These are actually my employers pretty is very unique. They match up to 5%. \"\n\nSaswat: \"Okay got it. If you put in seven they put in five. God had got it. So 141 match until five percent. \"\n\nDrew: \"Yeah the very very generous. My job doesn't pay a ton of money but they are very generous with their benefits. \"\n\nSaswat: \"got it. So, in the questionnaire, I believe you mentioned that say you're paying a little but not the maximum match but it, I guess. Yeah, I'm curious. Why why you believe that you were not paying the maximum employment? \"\n\nDrew: \"Okay, well I think I allow I think 15 percent 15 I think they allow that but because my wife has an IRA we decided for me, just ask. Oh, it's about seven percent. \"\n\nSaswat: \"Oh, I see, I see \"\n\nDrew: \"yeah, so I think, you know, I think before I met my wife, 12 years ago, I was doing about 15%. And then I married, you know how it is when you have kids and you have bills and house, you know, you gotta save money and so I cut down to 7% but they were still willing to match my company 5%\"\n\nSaswat: \"So, if you were at 15%, how much would they match?\"\n\nDrew: \"I think, you know, I think they matched 10, they were very generous\"\n\nSaswat: \"So you're actually missing out to some extent on that extra 5%. Then. \"\n\nDrew: \"Yeah, I am. But you know what? It's like throwing money away. But right now, I think because this inheritance death we got I'm gonna change that back to. I think fifteen percent might as well. Right? \"\n\nSaswat: \"Yeah, I think absolutely. Absolutely. So that's that makes a lot of sense. And can you tell me more about the inheritance in terms of? Yeah. What, what was, what would the assets that you received?\"\n\nDrew: \"Yeah with the death of a cousin who was who was wealthy. He left me property up in the mountains in Colorado. in the Rockies and also, Quite a bit of cash because we were like brothers growing up and everything. So yeah we he left me quite a bit of a money-wise and so we decided to take that and just start paying off bills, start doing stuff. You know, the other thing that we want to do is do a 529 with the kids for college education. That's important. You know everything is about the kids now. Which is great. So yeah. So the inheritance was cash and all left in a while, and then a property up in the Colorado Rockies.\"\n\nSaswat: \"Got it, got it first off. Sorry, to hear about your cousin, but also happy to hear that you're able to pay off your debts. So can you tell me was the amount of the cash that you received, as well as the value of the property?\"\n\nDrew: \"that was roughly Roughly 75. \"\n\nSaswat: \"Okay, 7:55, okay\"\n\nDrew: \"In cash 75. Yes it was. \"\n\nSaswat: \"75 in cash, got it\"\n\nDrew: \"That was it had to be taxed, even inheritance is taxed. So yeah, it was about 75 K\"\n\nSaswat: \"75, and then the property, how much would that be? \"\n\nDrew: \"Oh man, I'm telling you, it's It's worth almost a million dollars. Because Colorado, the mountains in Colorado, very very very, very, very expensive Rich. Yep. \"\n\nSaswat: \"Okay. Great great. Do you tell me about any other assets, you have? So you mentioned your, how much is the home value again?\"\n\nDrew: \"The home value is 650. \"\n\nSaswat: \"650, okay, got it, he's got 650 home, you've got these assets, you've inherited, you've got the iris 401K balance of 115. Any other assets? \"\n\nDrew: \"Yeah I got back when I was in the military back when I was 18 years old man 35 years ago I invested in a company little known at the time it was called Microsoft. So I had stocks. You know that I was overseas, I just kept putting money in some stocks and so assets. Yeah I got assets and that's because of those stocks that I still have. Very, very lucky. I was very lucky. \"\n\nSaswat: \"Great. Great. Yeah. And, and how much was that, or how much is it worth today? \"\n\nDrew: \"I guess it's worth half a million. \"\n\nSaswat: \"Okay. So you've got about 500 K roughly. \"\n\nDrew: \"Yeah. \"\n\nSaswat: \"And do you still have the shares or have you sold them?\"\n\nDrew: \"I've sold a few over the years but yeah I started out it was like less than a thousand dollars. Back in 1990 and now it's Yeah, so I still I still say yep. So all this stuff, you know, is going to be for us for retirement. And for the kids, we just got to learn how to put it all together, you know?\"\n\nSaswat: \"Yep. Yep. So you mentioned in your thoughts and retirement that you're trying to think of ways in which you can save enough money to survive with the decent retirement. So I guess, yeah, what are you? What are your thoughts now, given? Where you're at in terms of how, how do you believe you're going to be able to survive with the kind of lifestyle that you're looking to have during retirement? \"\n\nDrew: \"Yeah, we're very blessed. We're very blessed guy, you know. But seeing what my in-laws go through, you know, with all the bills that when you get older, you got health insurance, you have to pay, you know, my in-laws, they pay 700 a month, you know, just for their health insurance, and that's with Medicare. So, you know, I think there's not enough, there's never enough money, amen? Right. There's never enough money, you know, for retirement. And so we want to live, we're not rich. We don't want to be rich, we just want to be able to Be comfortable. So, what a retirement we're just we just have that fear that money will run out, no matter how much we got right now. And we also worried that we will make a mistake down the road and we didn't do something right, you know, like when right now and so, so that's where the Fear Factor comes in, you know, that's why we're going to hire professional because we want to make sure we're doing things, right? So, you know, we just want to live where we can pay the bills. Everything is going to get more expensive nowadays. United States is not going to get any cheaper. So, right now, I think we're on the right track with everything we have. We just need help putting it all together to make, to maximize what we have. \"\n\nSaswat: \"Got it, that makes a lot of sense. \"\n\nDrew: \"And the kids, the kids, everything is about the kids, the kids are going to need things when they grow up, you know. So you know we want money for the kids too\"\n\nSaswat: \"Got it. Got it and I forgot to ask your wife. Sorry how much is that worth right now? \"\n\nDrew: \"Yeah. She after or her salary? \"\n\nSaswat: \"oh her ira\"\n\nDrew: \"Oh her ira I think is almost 100. Yes, she's been working since she was 18, so yeah. \"\n\nSaswat: \"Okay. Great, great. How do you and your, I guess your wife divide up thinking about retirement. \"\n\nDrew: \"Good question. Good question. You know, we had this inheritance and all of a sudden were like whoa what do we do with all this? Do we put it all in a bag?\"\n\nSaswat: \"Was the inheritance expected or completely unexpected or\"\n\nDrew: \"it was completely unexpected. I thought I thought my cousin might give me the property you know and we're going to we're going to keep, we're going to keep the property. Yeah I did we weren't expecting cash or nothing like that so that was unexpected. Yeah, so we we, you know, we thought we, we putting all this money into bank accounts, you know, that's great, but it's just that money is just sitting there. So we have all this money in a bank account and it's just not doing anything so to meet to us. That's not really planning for retirement\"\n\nSaswat: \"got it. And just so I got the number, right? You said you have 75k or was that inheritance from?\"\n\nDrew: \"From the inheritance\"\n\nSaswat: \"So that that cash is just sitting in the bank account. \"\n\nDrew: \"Yeah. After we pay it off or bills about 50 about 50k\"\n\nSaswat: \"So 50k just sitting there and you're still trying to figure out what to do with that. \"\n\nDrew: \"Yeah, you know, and especially with the economy today. So, you know, there's thoughts of investment. You know, investing you know but what is the best plan for us? We we don't know where we're kind of lost so that's what we're going to see a financial planner you know. I mean yeah and then I have those stocks from Microsoft, you know that I could use, you know something here and there for you to help with the kids college education, everything costs money, and everything is gonna you think you have enough money and all of a sudden you don't. So I think investing is something that we're going to start looking into more. And maybe an annuity, if we can figure out how that works\"\n\nSaswat: \"Got it. Got it. And you mentioned, a 529 plan and something you're looking to start setting up. Do you already have a 529? Or are you looking to now? \"\n\nDrew: \"We haven't set up the 529 yet yet. Yeah we should have but at this point we'd be foolish not to. Especially our daughters eight now so and our sons five. So we got to get going on that.\"\n\nSaswat: \"Got it. And then what about hsas? Are you? I guess. Yeah. What's your approach to saving for healthcare?\"\n\nDrew: \"You see, that's that, that is, I'm not good at the healthcare, understanding all that works a healthcare savings account. I'm clueless. And that's another reason we have to go to a financial advisor because that's very important. And I really don't understand how that works with retirement. You know, I can talk to my father-in-law, he knows more about that stuff and his financial planner, that's where we're going to. We want to go see as my father-in-law's financial planner, but I don't understand. All that stuff, very much and that actually scares me more than any. Other thing is, the healthcare stuff when I retire\"\n\nSaswat: \"Got it, got it and and and the fact that your wife is a nurse sort of does it help with with that or surprisingly less than you would think?\"\n\nDrew: \"I think its surprisingly less. she's a good nurse, she's a good nurse.\"\n\nSaswat: \"Yeah system's just complex\"\n\nDrew: \"It's too complex. It makes me like you want to yell\"\n\nSaswat: \"Yep. Yep. Absolutely, great. Do we have any other questions Robin will burn, before, I jump into the product\"\n\nDrew: \"Ask away, Robin ask away Wilbert what you got? \"\n\nRobin: \"Yeah just wanted to check in on how often you check your retirement account. Like how often do you log into? I don't know if it's a Vanguard or Fidelity account or the like and kind of check in on those balances and how you track your, your financial status.\"\n\nDrew: \"Yeah, I'll be honest, the Fidelity's, what we use. I check in almost every day because I'm trying to learn more and more and more. It's at least weekly but like sometimes it's every day, I'm trying to learn research. Wrap my head around it. So I ask you a question, right? I'd say almost it's at least weekly. I'm checking things out.\"\n\nWilbert: \"Okay. And and what kind of investment options have you chosen do?\"\n\nDrew: \"well, maybe swell not a whole lot, just Just do the 401K and my wife with hurairah but, you know\"\n\nSaswat: \"The 401k and the ira, what is what I guess funds are those are, those are sitting in\"\n\nDrew: \"oh mutual funds\"\n\nSaswat: \"mutual funds got it, and in any specific kind of mutual fund like Target date funds, for example, or yeah? Yeah, \"\n\nDrew: \"yeah, EFTs right?\"\n\nSaswat: \"yeah\"\n\nDrew: \"which is complex in its own way. That's why I like we need help. I mean sometimes I wonder if I'm doing the right thing. I listened to the robo advisor on Fidelity. I'm like man I hope I'm doing the right thing especially with EFT s because that confuses me too. You guys, you guys know all this stuff man. You guys like for the normal guys like I gotta go to college just learn all this stuff all over, you know, for four years? \"\n\nSaswat: \"Absolutely, absolutely infidelity, I mean, I put my money with the Fidelity Robo advisor, my IRA so we'll see how it goes. \"\n\nDrew: \"I like Fidelity, I think it's great.\"\n\nSaswat: \"Great. And actually one more question on your FICO score. What is your FICO score?\"\n\nDrew: \"780\"\n\nSaswat: \"780. Got it. Now it sounds like so this inheritance was unexpected happened. Very recently. And you've been at 7% on the 401 k. Given that you have the inheritance now, are you planning on actually pumping up the 401K to 15% to get there extra 10% in the employer. Or are you going to hold back for a little bit? What are your thoughts now? Now that you know you're losing out on 5% of your of your of your employer match which can be five thousand dollars a year. What are your thoughts there?\"\n\nDrew: \"Yeah, I think I'm going to wait till the beginning of the new year. I'm think about open up my own business. Basically, what I do for a living is I write grants? So I can do this on my own. But the, you know, there's pros and cons with that. So, you know, at the beginning of the year, I'm going to make decision whether to open my own business or not. If I don't, then I'm gonna just go back to 15% on that. On the 401 k because I'd be very foolish not to especially now that we can, if I can, if we can afford to do that\"\n\nSaswat: \"You got it, you got it. That makes sense. Got it. So and you actually feel like you have the cash to be able to invest in a 401k, right? \"\n\nDrew: \"Correct now, now we do. Ya got it. \"\n\nSaswat: \"So yeah. Let me let me actually spend a couple minutes and walk you through what we're looking to do and would love to hear your thoughts around this and and and given that you're actually looking to start putting in the money yourself, right? Without the need for our product, you might not necessarily be the best fit. But we'd love to hear your thoughts around whether you know, around when you hear product like this, and let's say you didn't have the extra cash. How would you think about it? Okay, so I'm going to share my screen really one second.\"\n\nSaswat: \"Can you guys see my screen?\"\n\nDrew: \"Oh yeah, I got it. Look at that. \"\n\nSaswat: \"Okay, okay, perfect. \"\n\nDrew: \"Nice graph\"\n\nSaswat: \"Yeah, yeah, perfect. So this graph here is just representing some of the numbers that you mentioned to me, which is at your current salary. Right? Which is 115 roughly with a 7% deferral where you could be doing, 15%. And your employer sort of does let's say a 67 percent match. Let's say they go up to two-thirds of the 15 which is 10%. Write your current age is 53 and you're looking to retire. You said early to mid 60's, I assume somewhere in the 65 range. You've probably seen a graph like this before, right? Which is where ours is a little different. So, the blue line is, is kind of where you are at today, right? Let's say you, you know, thinking about the funds that you're investing in your 401k if you're putting in seven percent, plus the employers 5% you're going to be at about Hundred little over 300 K in pre-tax dollars in your 401k by the end of 65. Right. I'm not including the 100K, you already have. I'm just starting from today. The green line is that if you would actually be at 15%, right, with an additional 10% from your employer, it'd be about 700 at the age of 65, right? So that's sort of the difference between these two\"\n\nDrew: \"the graph shows all man, that is something else. \"\n\nSaswat: \"Yeah absolutely absolutely. And the yellow dotted line is going to be the cash that you're getting from the employer, right? So the distance between the Blue Line in the yellow line, that's the employer funds, the other line to the gray line that is what you're putting in yourself, right? So that's kind of the, the split between these two. Now, the service that we're providing is we found a lot of people are unable to maximize their match because of short-term cash needs, right? So for example, you know people It's struggle with being able to pay off a bill, right? Are don't know if there's going to be a bill coming up this month that they're not going to be off and so rather than putting $200 into the 401 k. It's easier to hold onto those two hundred dollars and you know if there is you know if there is a rainy day you use that for the rainy day if not, you use it to pay off the existing debt and that's sort of something we've seen. Now for the problem with that approach is that you're losing out on that employer match, right? Let's see. Oh yeah, to give them at simpler. So you get three hundred dollars you put in $300, your employer puts in 200, right? You're sort of missing out on that on that two hundred dollars in matching by. Not going for the employer match. Right now, what we do is we bust basically provide a cash advance to you on a monthly basis if you maximize your 401k, right? So I'm going to do some actually I'm gonna do some really basic math for you first, which is that lets say it's about 8% of your salary that you would have to put in on a monthly basis straight so that ends up being about $750 a month. Yeah. Okay right so there's about seven hundred fifty dollars a month and that you would need to put in to get the extra $500 a month from your employer, right? That extra eight percent right. So that's 750 a month from you and 500 from your employer. What we what we do is we will require that you put in the extra 700 Fifty dollars into your 401k account. So now your bank account is short by a $750, right? But your 401k account now gets the extra 500. And what we do is we give you that 750 dollars in cash. On a monthly basis. So the idea is that you're able to hold on to the cash that you would have had otherwise right? But it is alone and you will have to pay us back at some point but it's a revolving loan. So the idea is we can pay you that amount on a monthly basis. Now if you don't find the need to use the cash, you can pay us back, right? But the idea is that it's the goal is to minimize the impact of short-term cash. Needs for folks that are not able to maximize their 401k. So given all that's love to hear your thoughts. \"\n\nDrew: \"You know, my first thought was well, I think the idea is brilliant, but at the same time there's always buyer beware, you know, it's like so you're so what you're saying is okay, let's say does the money that you loan me? Go straight to me or does it go straight to? The no wouldn't go to the 401 k? It would go straight to me.\"\n\nSaswat: \"Exactly because you're already taking money from your payroll and putting that 750 into your 401 k. So what we do is we give you that 750 in your bank account\"\n\nDrew: \"so yeah, one of my questions was how would you know what I'm doing with my 401 k.\"\n\nSaswat: \"So we use, we use an API, like it's a software connection, do your brokerage account and actually, since you use Fidelity, it would just work seamlessly, right? And so through Fidelity, we know that you've increased your match to 15%, right? And we can verify that on a monthly basis, right? So if we find that you've changed, your match will will sort of withhold the the funds for the next month\"\n\nDrew: \"Yeah, okay, yes, basically, it's the same as a personal loan. It's just a stipulation. Is that the 401K the 15% has to be matched? \"\n\nSaswat: \"Exactly. \"\n\nDrew: \"It's the same thing. It's the same concept. So my thought is well, yeah, that's a great idea. I think this it's very, you can take that the Shark Tank. I think it's excellent. But then, you know, you got to come into the real. Real life is like, well, how much, what's the interest rate on all this, you know? So I think the idea is very, very excellent. I think it's something that, you know, Like this year before I got, the inheritance is something I could have used when I drop down to 7% because we needed that short term for for bills from health health stuff regarding with my kids they get health insurance wasn't covering so this I mean this one is something I would have looked into if I had known about something like this so you know but it all comes down to the fine print you know how much you know, how soon do you have to pay it back? How long? I mean, what if I just need it for like three months? How does that work? You know? Or is this something that I could do like for two years but what's the contractual obligation there? I think so. I think the idea is excellent but I think you know I would have a like 2 million questions for you guys. \"\n\nSaswat: \"Got it to let's let's answer some of these questions and please keep asking all the questions you would have because we're trying to understand what those questions are also recognized. We've actually gone over time. So if you don't mind spending five more minutes would love to. So I'll answer some of the things you mentioned. So let's say you're putting in 750 a month, right? At the end of a year that would be about about 8,500. Let's say right 8,500. Sort of it would actually be closer, it would be nine thousand and been uh nine thousand a year, right? So that would probably be the credit limit on the service which means that you can actually be drawing down funds on this credit line for a full year before you max out, and we're not able to give you more funds until you pay down. Try to we're targeting somewhere between like a year, a year and a half worth of funds. We're not sure exactly what that number is going to be but let's say it's about a year, right? So the idea there is that we don't want to be in a situation where we're now the way we make money as I'll explain that but we don't want people to be in a situation where they're actually losing money by working with us. Right? We want to make sure that that the value we provide is above the value that you would get is or the cost. Part of the service we provide is far lower than the value. That we that we provide now on the which is why we don't want it to be a high credit limit because, you know, once let's say you've racked up thirty thousand dollars in debt, that becomes harder to pay off right.\"\n\nDrew: \"yeah its like your credit card\"\n\nSaswat: \"Exactly, exactly. So, now in terms of the fees, right, the way we're thinking about this is that we would have a ten dollar a month P, right? So in your case, for example, we would charge ten dollars a month in order to unlock the five hundred dollars a month that you get from your employer and the and this is a fee for using our product, right? But we would charge an interest rate that's about three to four percent lower than your credit card, interest rates, okay? So what are your thoughts when you hear that?\"\n\nDrew: \"Well, I'm here to $10 a month. Charles, I like, well, that's that's pretty cheap. You guys could probably bump that up. You know, I'll be honest. You know, that's pretty. It's pretty inexpensive. I think to access that kind of work, whatever. So, ten dollars, that's extremely inexpensive. Yeah. And then what you were saying about the? That's what I expected. There's some credit card rates, interest, or or underneath that. My question is, I mean, so it's like, so you make a monthly payment or like a credit card? Can you make it exact minimum? You have to make a maximum?\"\n\nSaswat: \"So lets think about it as very similar to a credit card in the sense that it's there isn't necessarily a payback increase over the lone person alone, you have to have like you have emis that you have to work on good work towards right think of this more, as a credit card, that gives you a cash advance every month and you can't actually pull additional funds from the credit card, right? We might have an emergency line. Maybe that we provide you in addition to this cash advance, but the majority of it. Think of it as a credit card where you've taken out the card itself, but you have a cash advance and the cash advance is something you get on a monthly basis at the, let's say, at the start or the end of the month and the payments will work. As there's a ten-dollar, a fee, that is charged to your to, you know, to whatever credit card you have. There's interest fees that are charged on the balance and then you can choose to pay it back whenever you want that there is a minimum payment, right? So there will be a minimum that let's say it's about Five to ten percent of the balance.\"\n\nDrew: \"Sure. Okay, so I think there's more wrapped, it sounds like there's more Pros to this than cons as far as I think there's more positives than negatives. On this idea that you have the another question I have, let's say I did this for a year, you know, short term, and then I paid up everything. We're all even Square. Six months later. I have another problem and I have to start that again. Can I do that twice? On the same account. If there's a break in between and I'm all paid up.\"\n\nSaswat: \"Yeah. So that we're trying to figure that out but I mean most likely, yes, right, most likely you could pause the service, right? Let's say you need the service for a couple months, you can use it and then you can pause the service is most likely what it is, actually, on that topic. I'm curious. Have you been in that sort of situation where you needed to be able to pull funds, you know, for a couple months, and then you're able to pay it back and yeah, it can you tell me more about that situation? \"\n\nDrew: \"Yeah, it was this year, my son had some health issues, Insurance wasn't paying for certain things, so we had to pay quite a bit of money out of our. So that's when I started going as when I went down 7% with my company and so it was that short term we had we just needed some more some more money than what we had but then need herons came and change everything. But yeah, this year we were got it. \"\n\nSaswat: \"So what you're saying is that if this product existed. I don't put words in your mouth, so I'd love to hear. Ya would love to hear if this is accurate. What would your saying is, let's say this product existed. When that moment happened, you're at 15%, you're saying that what you might have done is stated 15% but Garden that differential that 750 dollars in cash advance for a couple of months maybe able to handle the bills. \"\n\nDrew: \"Absolutely because the six months early eight months I had to go back down to seven percent that's throwing money out. The window form is free money from my employer. So what you guys are kind of your idea is kind of like a stopgap. It's kind of like a helping hand, you know, to get you through six months or a year, you know. So yeah. I think I think that's up if I had known about something like that, I would have looked into it right away. I'll probably gonna probably, would have done it. \"\n\nSaswat: \"And the fact that and the fact at that it's it's 750 in cash per month. I presume the bills that you had Raschi higher than that. So it's not like you would get a cash advance where you could just pay off all those bills with our product, right? It would be you'd have to do some mix between our product and then a credit card where you're sort of adding on adding on the bills, How would how would that work? How would you think about doing something like that?\"\n\nDrew: \"Well, you know, we would just, we would have budgeted with those with those debts with the medical debt, we would have budgeted where we can maximize our payments. You know, not with that with that cash advance so to speak. So I think that's that's the first thing I thought was, you know, it's not going to fix everything but it sure is going to help. Right? And, and then Meanwhile my eye. My 401k is still making money. So, I mean, it's, I think it's a win-win scenario. I think it's also like a hand up. Not a handout that the intention there is, you know, read the fine print. Everything works at the intention is to help not to hinder. So, I think again, I think the idea is a win-win to Ariel.\"\n\nSaswat: \"wilbert robin. Any other questions? \"\n\nWilbert: \"Yeah, Drew in. Just two to the question that you raised, right? You may use it for a while. It would go dominant, it would work very much like a credit card, right? If you stop using a credit card for a few months, they don't it doesn't shut down, right? I will wait so you will struggle on and and the thinking is if you're willing to pay the ten dollar monthly fee, it's going to stay current.\"\n\nDrew: \"Now, I see if you keep continuing to pay the fee and you, you have access. \"\n\nWilbert: \"Absolutely. That's what the fee gets you right continued access. \"\n\nDrew: \"its like retaining a lawyer\"\n\nWilbert: \"at $10 a month\"\n\nDrew: \"$10 a month. \"\n\nWilbert: \"Yeah. Exactly. \"\n\nDrew: \"I'm sorry. I interrupted you Wilbur know. \"\n\nWilbert: \"So, so that's what we are thinking. Now if something really bad happened to you, let us say V. We would look at your credit report on a periodic basis to just like a credit card does. And if we notice, for example, something really bad had happened, you know, you started to go delinquent on all your other loans in those kinds of situations. Yeah. Something might change but those are extreme cases. \"\n\nDrew: \"Yes, okay, sounds good. So work also just in case this happens again man to me where can I sign up? Or is it hush hush?\"\n\nSaswat: \"I will I will be following up over email and I'll add you to our mailing list. We're hoping to launch in a couple of months and so we'll keep you posted and yeah, I'd be, I'd be very curious. Let's say let's say things like this, don't happen to you in the future, right? But given where you are today given your financial situation realistically. Like let's say I was pitching you the product today for you know signing up for it on the spot. Right? Is it a product that you would actually see? Sign up for, let's say, let's say that you do plan to stay with your employer because understanding that. Yeah, if you switch over to your own business, it's a completely different situation. Let's say you do plan to stay with your current bar, is this the kind of product that you would actually use to get access to additional liquidity or, or given that you have enough cash in the bank you don't need something like this right now. \"\n\nDrew: \"It's absolutely. I would use it. It's $10 a month. That's to Starbucks coffees. Well, you know, it's like it's not, it's really, really It's wise and it and it gives peace of mind. So, yeah, absolutely. I would, I would pay to ten dollars a month even I've got no problems financially right out. I would pay it. Just just to have that peace of mind. Hey man, when that happens something happens, I have somebody to go to. So yeah, ten bucks a month, is it? That's a very small price to pay for peace of mind.\"\n\nWilbert: \"Awesome, well, Drew, let's say you found out about the solution. Who do you think about telling your friends about it?\"\n\nDrew: \"Oh, heck yeah, heck yeah, I would tell my co-workers. I would, I mean, you know, let's say everything worked out fine. I read the fine print and everything's working out, fine. Heck yeah, I'd put it on, I put it on my lap, put it on my LinkedIn page, you know, check this out. This is really a good stopgap. This is something that this is a little hidden treasure here, you know, we'll call it the Wilbert Panda company, you know, check them out.\"\n\nSaswat: \"Awesome. Well, I'm sorry to bother you with one last question. Oh yeah, we're super over time. But what's the best way for us to reach you? Let's say, let's say we never had this call, right? How could we actually be able to reach you right to find out about a service like this? What I mean is you know when you normally sign up for new services and stuff, how do you find out about them? You know is it through mail, is it through, you know, Facebook and Google, you know, or social ads like. What is the what is the best way to? Yeah, to reach reach you. I'm trying to think about like what's the best way for us to Market to someone like you? \"\n\nDrew: \"Yeah to advertise. Well, yeah, you can't go wrong with Facebook or social media. You know, something I've noticed is LinkedIn, you know, I don't there they don't necessarily have ads but they have companies that display. I get, I see a lot. And I do a lot of, I've learned from a lot of companies and I've used companies and youth services from looking at them on LinkedIn. That's like the Facebook for business, really. It's really where it is. So yeah. But you can never go wrong with social media. For me, it'd be social media email or LinkedIn. \"\n\nSaswat: \"Got it, so email, LinkedIn and social media, specifically, Facebook, or are there other social platforms as well. \"\n\nDrew: \"YouTube is a huge one. \"\n\nSaswat: \"Okay, YouTube and Facebook. \"\n\nDrew: \"Especially if you had your own little commercial, you know, introduction. You know, because my family were always on YouTube.\"\n\nSaswat: \"Got it got it and so YouTube is number one Facebook somewhere. Got it. Awesome. Well thank you so much Drew. This has been super helpful and really appreciate you taking the time. \"\n\nDrew: \"Oh you guys going to be millionaires here next year? \"\n\nSaswat: \"Well we hope we make everyone else millionaires. I mean that's that's a goal. \"\n\nDrew: \"Yeah but please send me the information though. \"\n\nSaswat: \"Thank you so much. \"\n\nDrew: \"Thank you. Happy holidays to you, too.\""
}
